def count_symbols_frequency(text):
	res={}
	for x in text:
		if x in res:
			res[x]+=1
		else:
			res[x]=1
	return res;

encoded_text = """
дмдєч — чєузнхарму бщшщдчмг бєдщґчє, йґщіму лє ґфлцнґфц щ бфчекчну бмбдвцн. йґщіму лє инййєхвчнбдс бвґвй бвцм іґєиндєянучф фгґщіхмю бщшщдчмгни бєдщґчє. оймчму бщшщдчмг щ бфчекчну бмбдвцн, егму цєо тнхачщ єдцфбьвґщ, тф бгхєйєодабе швґвиєжчф л єлфдщ у цвдєчщ, є дєгфж оймчв цнбяв, фгґнц лвцхн, йв лчєуйвчф ґнймчм щ ьфґцн цфґни, флвґ дє ґнкфг.        

дмдєч инйгґмдму и 1655 ґфян єбдґфчфцфц юґмбдмечфц ісуівчбфц, егму йфбхнйжщиєи гнхаяе бєдщґчє лє йфшфцфіфс двхвбгфшє. и 1944 ґфян ибдєчфимхм, тф бщшщдчмг цєо тнхачщ єдцфбьвґщ. ишґфйфиж чєбдщшчмю йвбедмхнда инч йфбхнйжщиєибе лє йфшфцфіфс гфбцнкчфіф двхвбгфшє «ієззх» дє гфбцнкчмю єшєґєдни «шнфчвґ-11», «ифейжвґ-1» дє «гєббнчн». щ 2005 ґфян чє шфивґючс дмдєчщ бни лфчй «ісуівчб», тф лґфзмхф уфіф йґщімц шґмґфйчмц бщшщдчмгфц бфчекчфп бмбдвцм, чє егн инйзщиєхєбе шфбєйгє гфбцнкчмю єшєґєдни.

дмдєч бгхєйєодабе швґвиєжчф л ифйечфіф хафйщ дє гєц'ечмбдмю шфґнй. шґмшщбгєсда, тф инч цєо ивхмгв гєц'ечмбдв ейґф дє гнхагє рєґни; цфжхмив нбчщиєчче шнйшфивґючвифіф фгвєчщ ґнйгфп ифйм. шфивґюче ґничмччє, л чвивхмгфс гнхагнбдс щйєґчмю гґєдвґни, інґ дє йсч; чєеичн флвґє л ґнйгфіф цвдєчщ.
"""

print(count_symbols_frequency(encoded_text))