# Переборні задачі

# Знайти двозначне число, яке у 7 разів більше своєї останньої цифри
# Пробігаємо по числах від 10 до 99 (включно)
"""
# Перевіряємо, чи справджується умова
# Якщо справджується,  то зупиняємося і повертаємо результат
for n in range(10,99+1):#у range число зліва береться, справа - ні
	d = n%10#знайшли останню цифру
	if n==d*7:
		print("Число знайдено!",n)
		# break
"""
"""
# Знайти двозначне число, яке у 6 разів більше суми своїхз цифр
for n in range(10,99+1):
	d = n%10 #знайшли останню цифру
	a = n//10 #знайшли першу цифру
	if n==(a+d)*6:
		print("Число знайдено!",n)
		break
"""
"""
# Знайти, скільки двозначних чисел рівно у 4 рази більше суми своїх цифр
total_numbers=0
for n in range(10,99+1):
	d = n%10 #знайшли останню цифру
	a = n//10 #знайшли першу цифру
	if n==(a+d)*4:
		print(n)
		total_numbers+=1
print("Всього чисел:",total_numbers)
"""
"""
# Скільки чисел від 1 до 12 не діляться на 5 та не діляться на 4?
# Треба перебрати всі а від 1 до 12
# Якщо число відповідає умові (не ділиться на 5 та не ділиться на 4), то
# збільшуємо рахівник на 1
total_numbers=0
for n in range(1, 12+1):
	if n%4!=0 and n%5!=0:
		total_numbers+=1;
print("Всього чисел:",total_numbers)

"""

# Скільки чисел від 1 до 100, які діляться на 12 та не діляться на 5?
# total_numbers=0
# for n in range(1, 100+1):
# 	if n%12==0 and n%5!=0:
# 		total_numbers+=1


# total_numbers=0
# for n in range(12, 100+1, 12):#будуємо range таким чином, щоб перша умова автоматично виконувалася
# 	if n%5!=0:#тоді треба перевіряти лише другу умову
# 		total_numbers+=1

# print("Всього чисел:",total_numbers)

"""
# N - ваш номер у журналі
k1 = ((N+17)*19)%50
k2 = k1+10
# Знайти число від 20 до 33, для якого відношення його добутку цифр до його суми цифр найбільше
# Зберігаємо найкраще досі знайдене число та найбільше відношення
best_n = 0
best_r = -1#початкове значення -1 вказує, що ще жодного числа не було переглянуто
for n in range(k1,k2+1):
	a = n//10#перша цифра
	b=n%10#друга цифра
	c = a*b # добуток цифр
	d = a+b #сума цифр
	r = c/d #відношення добутку до суми
	if r>best_r:
		best_r = r
		best_n = n
print("Відповідь:", best_n)


"""

# Задача: скільки 3-цифрових чисел маєть першу цифру, що удвічі більша суми двох наступних?
total_numbers = 0
#Додаткова задача: знайти суму цих чисел
sum_numbers = 0
for n in range(100, 1000):
	#розкладаємо число по цифрах
	a = n//100#перша цифра
	b = (n//10)%10#друга цифра
	c= n%10 # третя цифра
	if a==2*(b+c):
		total_numbers+=1;
		sum_numbers+=n
		print(n)

print("Кількість:", total_numbers)
print("Сума:", sum_numbers)
